import UIKit

// MARK: Подготовка
// 1. Проверка наличия гита и его версии ------------------------------
/// git --version
// 2. Задать имя и почту пользователя в гите --------------------------
/// git config --global user.name "Aleksey Nosik"
/// git config --global user.email aleksey.dev27@gmail.com
// 3. Проверка имени и почты пользователя -----------------------------
/// git config --global user.name
/// git config --global user.email
// 4. Перезапись имя пользователя -------------------------------------
/// git config --global --replace-all user.name "Ivan Ivanov"

// MARK: Локальный репозиторий
// Открываем папку с проэктом в терминале и инициализируем его --------
// В папке проэкта должна появиться папка .git


// 1. Узнаем текущее состояние репозитория (ветки + коммиты, неотслеживаемые файлы)
/// git status

// 2. Добавляем файл в гит, чтобы он отслеживал его изменения
/// git add GitTest







///
